# 1. Прямоугольник
# Напишите программу, которая считает площадь прямоугольника, спрашивая у пользователя длину двух сторон.
a = input('a: ')
b = input('b: ')
s = float(a)*float(b)
print ('Площадь равна:', s)